Revit 2024 API
RiserToTreadConnectionOption Enumeration
 Represents the connection style of the riser and tread in relation to each other.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public enum RiserToTreadConnectionOption
Visual Basic
Public Enumeration RiserToTreadConnectionOption
Visual C++
public enum class RiserToTreadConnectionOption
Members
Member name | Description
RiserBehindTread |  The connection will extend riser behind tread.
TreadUnderRiser |  The connection will extend tread under riser.
JoinAll |  The connection will join all risers and treads.
See Also
Autodesk.Revit.DB.Architecture Namespace